app/controllers/api/lines_controller.rb

  def index

    lines = Array.new
    Line.all.each do |l|
---
SELECT "lines".* FROM "lines"

  def show
    @line = Line.find(params[:id])
    @lineStations = LineStation.where( :line_id => params[:id])

    @stations = Array.new
    @lineStations.each do |ls|
---
SELECT "lines".* FROM "lines" WHERE "lines"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "line_stations".* FROM "line_stations" WHERE "line_stations"."Line_id" = 1 LIMIT 1
SELECT "line_stations".* FROM "line_stations"
SELECT "stations".* FROM "stations" WHERE "stations"."id" = ? LIMIT 1  [["id", 1]]