app/controllers/api/registrations_controller.rb

INSERT INTO "users" ("address", "authentication_token", "ccnumber", "cctype", "ccvalidity", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "last_sign_in_at", "last_sign_in_ip", "name", "remember_created_at", "reset_password_sent_at", "reset_password_token", "role", "sign_in_count", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    user = User.new(params[:user])
    if user.save