app/controllers/api/reservations_controller.rb

  def index

    reservations = Reservation.all
---
SELECT "reservations".* FROM "reservations"

  def show

    reservation = Reservation.find(params[:id])
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", "1"]]

  def cancel

    @reservation = Reservation.find(params[:id])
    @reservation.update_attributes(:canceled => true)
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "reservations" SET "canceled" = 't', "updated_at" = '2012-11-11 05:51:18.368433' WHERE "reservations"."id" = 1

  def create

    reservation = Reservation.new(params[:reservation])

    if reservation.save

      departureStation_id = params[:reservation][:departureStation_id].to_i
      arrivalStation_id = params[:reservation][:arrivalStation_id].to_i
      time = Time.parse(params[:time])
      date = Date.parse(params[:reservation][:date])

      result = Array.new

      makeReservations( departureStation_id, arrivalStation_id, Array.new, result)

      result << departureStation_id.to_i

      result.reverse!

      for i in 0..(result.count-2)

        trip = getNextTrip(result[i], result[i+1], time)

        rt = ReservationTrip.new(:trip_id => trip.id, :reservation_id => reservation.id, :departureStation_id => reservation.departureStation_id,
                                  :arrivalStation_id => reservation.arrivalStation_id, :date => reservation.date)

        rt.save
---
INSERT INTO "reservations" ("arrivalStation_id", "canceled", "created_at", "date", "departureStation_id", "updated_at", "user_id", "uuid") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "reservation_trips" ("arrivalStation_id", "created_at", "date", "departureStation_id", "reservation_id", "trip_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)