app/controllers/api/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."login" = '' LIMIT 1
---
  def create
    build_resource
    resource = User.find_for_database_authentication(:email=>params[:user_login][:email])