app/controllers/api/stations_controller.rb

  def index
    @stations = Station.all
---
SELECT "stations".* FROM "stations" ORDER BY name ASC

  def show
    @station = Station.find(params[:id])
    @lineStations = LineStation.where( :station_id => params[:id])

    @lines = Array.new
    @lineStations.each do |ls|
      @lines << Line.find(ls.line_id)
---
SELECT "line_stations".* FROM "line_stations" WHERE "line_stations"."station_id" = '1'
SELECT "stations".* FROM "stations" WHERE "stations"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "lines".* FROM "lines" WHERE "lines"."id" = ? LIMIT 1  [["id", 1]]