app/controllers/api/trips_controller.rb

  def index

    trips = Array.new



    Trip.all.each do |trip|
      trips << { :id => trip.id, :time => trip.beginTime.strftime('%H:%M'),
                 :departure_station => Station.find(trip.DepartureStation_id).name,
                 :arrival_station => Station.find(trip.ArrivalStation_id).name }
---
SELECT "trips".* FROM "trips"
SELECT "stations".* FROM "stations" WHERE "stations"."id" = ? LIMIT 1  [["id", 5]]

  def show

    trip = Trip.find(params[:id])

    departureOrder = LineStation.find_by_Station_id(trip.DepartureStation_id).order
    arrivalOrder = LineStation.find_by_Station_id(trip.ArrivalStation_id).order

    lineStations = LineStation.where(:order => departureOrder..arrivalOrder)
    if departureOrder < arrivalOrder
      lineStations.order('order ASC')
    else
      lineStations.order('order DESC')
    end

    times = Array.new
    currentTime = trip.beginTime
    lineStations.each do |ls|

      station = Station.find(ls.Station_id)
      train = Train.find(trip.Train_id)
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "line_stations".* FROM "line_stations" WHERE "line_stations"."Station_id" = 1 LIMIT 1
SELECT "line_stations".* FROM "line_stations" WHERE "line_stations"."line_id" = 2 AND ("line_stations"."order" BETWEEN 1 AND 5)
SELECT "line_stations".* FROM "line_stations" WHERE "line_stations"."Line_id" = 1 LIMIT 1
SELECT "stations".* FROM "stations" WHERE "stations"."id" = ? LIMIT 1  [["id", 1]]
SELECT "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT 1  [["id", 4]]