app/controllers/lines_controller.rb

  def index
    @lines = Line.all
---
SELECT "lines".* FROM "lines"

  def show
    @line = Line.find(params[:id])
---
SELECT "lines".* FROM "lines" WHERE "lines"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @line = Line.find(params[:id])
---
SELECT "lines".* FROM "lines" WHERE "lines"."id" = ? LIMIT 1  [["id", "1"]]