app/controllers/line_stations_controller.rb

SELECT "line_stations".* FROM "line_stations"
---
  def index
    @line_stations = LineStation.all

SELECT "line_stations".* FROM "line_stations" WHERE "line_stations"."id" = ? LIMIT 1  [["id", "lines"]]
---
  def show
    @line_station = LineStation.find(params[:id])