app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations" WHERE ('t'='f')
---
  def index
    @reservations = Reservation.all

SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", "linestation"]]
---
  def show
    @reservation = Reservation.find(params[:id])

SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @reservation = Reservation.find(params[:id])