app/controllers/reservation_trips_controller.rb

  def index
    @reservation_trips = ReservationTrip.all
---
SELECT "reservation_trips".* FROM "reservation_trips"