app/controllers/stations_controller.rb

  def index
    @stations = Station.all
---
SELECT "stations".* FROM "stations"

  def show
    @station = Station.find(params[:id])
---
SELECT "stations".* FROM "stations" WHERE "stations"."id" = ? LIMIT 1  [["id", "1"]]