app/controllers/trains_controller.rb

  def index
    @trains = Train.all
---
SELECT "trains".* FROM "trains"

  def show
    @train = Train.find(params[:id])
---
SELECT "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT 1  [["id", "1"]]