app/controllers/trips_controller.rb

  def index
    @trips = Trip.all
---
SELECT "trips".* FROM "trips"

  def show
    @trip = Trip.find(params[:id])
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", "6"]]