app/controllers/trip_types_controller.rb

SELECT "trip_types".* FROM "trip_types"
---
  def index
    @trip_types = TripType.all

SELECT "trip_types".* FROM "trip_types" WHERE "trip_types"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @trip_type = TripType.find(params[:id])