app/controllers/users_controller.rb

  def promote
    User.find(params[:id]).promote
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def demote
    User.find(params[:id]).demote
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]